title: Ransom.MSIL/nCoV Detection
id: 6b9dd58d-ee56-4ca9-8d0a-2ff68afd934d
status: experimental
references:
    - https://github.com/robindimyan/covid-cyber-response/wiki/2--Fidye-Zararl%C4%B1s%C4%B1-Tehditleri
description: Detects n2019CoV Ransomware Persistency Activity
author: Robin Dimyanoglu
date: 12/04/2020
tags:
    - attack.persistence
    - attack.t1060
logsource:
    product: windows
    service: security
detection:
    selection_file:
      EventID: 4656
      ObjectName:
        - 'C:\Users\\*\AppData\Local\\*.scr'
        - 'C:\Users\\*\AppData\Local\\*.pif'
        - 'C:\Users\\*\AppData\Local\\*.com'
        - 'C:\Users\\*\AppData\Local\\*.exe'
    selection_registry:
      EventID: 4657
      ObjectName: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\\*'
      NewValue: 'C:\Users\\*\AppData\Local\\*'
    selection_startup:
      EventID: 4656
      ObjectName:
        - 'C:\Users\\*\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup\\*.lnk'
        - 'C:\ProgramData\Microsoft\Windows\Start Menu\Programs\Startup\\*.lnk'
    timeframe: 1m
    condition: selection_file | near selection_registry or selection_startup
falsepositives:
  - Unknown
level: high
