title: Trojan.Trickbot/Emotet Detection
id: d9c19c1c-877b-4288-a40c-035e33def0a1
status: experimental
references:
    - https://github.com/robindimyan/covid-cyber-response/wiki/2--Fidye-Zararl%C4%B1s%C4%B1-Tehditleri
description: Detects Trickbot/Emotet Modules Security Tool Disabling and Persistency Activity
author: Robin Dimyanoglu
date: 05/04/2020
tags:
    - attack.persistency
    - attack.defense_evasion
    - attack.t1053
    - attack.t1089
logsource:
    product: windows
    service: security
detection:
    selection_modules:
      EventID: 4656
      ObjectName:
        - 'C:\Users\\*\AppData\Roaming\\*\injectDll*'
        - 'C:\Users\\*\AppData\Roaming\\*\networkDll*'
        - 'C:\Users\\*\AppData\Roaming\\*\pwgrab*'
        - 'C:\Users\\*\AppData\Roaming\\*\systeminfo*'
        - 'C:\Documents and Settings\\*\Application Data\\*\injectDll*'
        - 'C:\Documents and Settings\\*\Application Data\\*\networkDll*'
        - 'C:\Documents and Settings\\*\Application Data\\*\pwgrab*'
        - 'C:\Documents and Settings\\*\Application Data\\*\systeminfo*'
    selection_taskscheduler:
      EventID: 4698
      Command:
        - 'C:\Users\\*\AppData\Roaming\\*.exe'
        - 'C:\Documents and Settings\\*\Application Data\\*.exe'
    selection_windefender:
      EventID: 4688
      NewProcessName|endswith:
        - 'sc.exe'
        - 'powershell.exe'
      CommandLine|contains:
        - 'stop WinDefend'
        - 'Set-MpPreference -DisableRealtimeMonitoring $true'
    condition: selection_modules or selection_taskscheduler or selection_windefender
falsepositives:
  - Unknown
level: high
